nxp-mcuxpresso/mcux-sdk-examples/frdmke04z/driver_examples/tpm/pwm_twochannel/pin_mux.h
/*
 * Copyright 2017 ,2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief FTM0CH0 Input Capture Source: FTM0_CH0 pin */
#define SOPT_FTMIC_0b00 0x00u
/*!
 * @brief UART0_RX Capture Select: UART0_RX input signal is connected to the UART0 module only. */
#define SOPT_RXDCE_0b0 0x00u
/*!
 * @brief
 * Single Wire Debug Port Pin Enable: PTA4/ACMP0_OUT/SWD_DIO as PTA4 or ACMP0_OUT function,
 * PTA0/KBI0_P0/FTM0_CH0/RTCO/ACMP0_IN2/ADC0_SE0/SWD_CLK as PTA0, KBI0_P0, FTM0_CH0, RTCO, ACMP0_IN2 or ADC0_SE0
 * function.
 */
#define SOPT_SWDE_0b0 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
